app/controllers/inquiries_controller.rb

SELECT  "inquiries".* FROM "inquiries" WHERE "inquiries"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    authorize @inquiry
    inquiry = policy_scope(Inquiry.where(:id=>@inquiry.id))

INSERT INTO "inquiries" ("subject", "description", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "roles" ("role_name", "mname", "mid", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["role_name", "organizer"], ["mname", "Inquiry"], ["mid", 1], ["user_id", 3], ["created_at", "2017-11-19 18:24:03.430360"], ["updated_at", "2017-11-19 18:24:03.430360"]]
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3
---
  def create
    authorize Inquiry
    @inquiry = Inquiry.new(inquiry_params)
    @inquiry.creator_id=current_user.id

    User.transaction do
      if @inquiry.save
        role=current_user.add_role(Role::ORGANIZER, @inquiry)
        @inquiry.user_roles << role.role_name
        role.save!